cyber_truck_coarse_mesh/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.78;	//0.24;

boundaryField
{

       bottom
    {
        type            fixedValue;
        value           $internalField;		//uniform 0.24;
    }
    
        top
    {
        type            inletOutlet;
        inletValue      $internalField;		//uniform 0.24;
        value           $internalField;		//uniform 0.24;
    }

        right
    {
        type            kqRWallFunction;
        value           $internalField;		//uniform 0.24;
    }

        RaceCar
    {
        type            kqRWallFunction;
        value           $internalField;		//uniform 0.24;
    }

        front
    {
        type           zeroGradient;
    }

    "(back|left)"
    {
        type           zeroGradient;
    }


    "proc.*"
    {
        type           processor;
    }
}


// ************************************************************************* //
